// 투표 결과 리스트
let votes = [
   '이재식', '이재식', '이규하', '이규하', '이규하',
   '이재식', '이재식', '이규하', '이규하', '이재식',
   '이규하', '이규하', '이규하', '이규하', '이재식',
   '이재식', '이규하', '이재식', '이재식', '이재식',
   '이재식', '이재식', '이규하', '이규하', '이규하',
   '이규하', '이규하', '이재식', '이규하', '이규하',
   '이규하', '이규하', '이재식', '이규하', '이규하',
   '이규하', '이재식', '이재식', '이재식', '이규하',
 ];
 
 // 후보별 득표수 객체
 let voteCounter = {};
 
 // votes 배열을 이용해서 voteCounter 객체를 정리
 for (let name of votes) {
   if (name in voteCounter){
     voteCounter[name]++;
   } else {
     voteCounter[name] = 1;
   }
   }
 
 
 // 후보별 득표수 출력
 console.log(voteCounter);  